; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v4 ?v5)
             (pred_12 ?v7 ?v10)
             (pred_2 ?v4 ?v10)
             (pred_1 ?v3 ?v4 )
	     (pred_9 ?v4)
             (pred_5 ?v2)
             (pred_11 ?v7)
             (pred_4 ?v10)
             (pred_3 ?v4)
             (pred_8 ?v7)
             (pred_6 ?v4)
             (pred_10 ))



(:action op_2
:parameters (?v13 ?v6 ?v8 ?v12)
:precondition (and (pred_5 ?v13) (pred_5 ?v6) (pred_11 ?v8) (pred_4 ?v12)
          (pred_7 ?v13 ?v6) (pred_12 ?v8 ?v12)
                   (pred_2 ?v6 ?v12) (pred_9 ?v13) 
                   (pred_3 ?v6) (pred_8 ?v8))
:effect (and  (pred_6 ?v6) (not (pred_3 ?v6))))


(:action op_4
:parameters (?v13 ?v11)
:precondition (and (pred_5 ?v13) (pred_5 ?v11)
               (pred_9 ?v13) (pred_7 ?v13 ?v11) (pred_6 ?v11))
:effect (and (pred_9 ?v11) (not (pred_9 ?v13))))

(:action op_5
:parameters (?v13 ?v8)
:precondition (and (pred_5 ?v13) (pred_11 ?v8) 
                  (pred_9 ?v13) (pred_1 ?v8 ?v13) (pred_10 ))
:effect (and (pred_8 ?v8)
   (not (pred_1 ?v8 ?v13)) (not (pred_10 ))))


(:action op_1
:parameters (?v13 ?v1 ?v9)
:precondition (and (pred_5 ?v13) (pred_11 ?v1) (pred_11 ?v9)
                  (pred_9 ?v13) (pred_8 ?v9) (pred_1 ?v1 ?v13))
:effect (and (pred_8 ?v1) (pred_1 ?v9 ?v13)
        (not (pred_8 ?v9)) (not (pred_1 ?v1 ?v13))))

(:action op_3
:parameters (?v13 ?v8)
:precondition (and (pred_5 ?v13) (pred_11 ?v8) 
                  (pred_9 ?v13) (pred_8 ?v8))
:effect (and (pred_10 ) (pred_1 ?v8 ?v13) (not (pred_8 ?v8)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_13 obj_27 obj_14 obj_22 obj_19 obj_11 obj_06 obj_07 obj_01 obj_21 obj_09 obj_25 obj_05 obj_12 obj_20 obj_03 obj_29 obj_23 obj_24 obj_10 obj_04 obj_28 obj_17 obj_16
    obj_08 obj_15
    obj_26 obj_18 obj_30
    )

    (:init
       (pred_10)

       (pred_5 obj_02)
       (pred_5 obj_13)
       (pred_5 obj_27)
       (pred_5 obj_14)
       (pred_5 obj_22)
       (pred_5 obj_19)
       (pred_5 obj_11)
       (pred_5 obj_06)
       (pred_5 obj_07)
       (pred_5 obj_01)
       (pred_5 obj_21)
       (pred_5 obj_09)
       (pred_5 obj_25)
       (pred_5 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_20)
       (pred_5 obj_03)
       (pred_5 obj_29)
       (pred_5 obj_23)
       (pred_5 obj_24)
       (pred_5 obj_10)
       (pred_5 obj_04)
       (pred_5 obj_28)
       (pred_5 obj_17)
       (pred_5 obj_16)
       (pred_4 obj_08)
       (pred_4 obj_15)
       (pred_11 obj_26)
       (pred_11 obj_18)
       (pred_11 obj_30)

       (pred_7 obj_02 obj_19)
       (pred_7 obj_02 obj_13)
       (pred_7 obj_13 obj_11)
       (pred_7 obj_13 obj_27)
       (pred_7 obj_13 obj_02)
       (pred_7 obj_27 obj_06)
       (pred_7 obj_27 obj_14)
       (pred_7 obj_27 obj_13)
       (pred_7 obj_14 obj_07)
       (pred_7 obj_14 obj_22)
       (pred_7 obj_14 obj_27)
       (pred_7 obj_22 obj_01)
       (pred_7 obj_22 obj_14)
       (pred_7 obj_19 obj_21)
       (pred_7 obj_19 obj_11)
       (pred_7 obj_19 obj_02)
       (pred_7 obj_11 obj_09)
       (pred_7 obj_11 obj_06)
       (pred_7 obj_11 obj_13)
       (pred_7 obj_11 obj_19)
       (pred_7 obj_06 obj_25)
       (pred_7 obj_06 obj_07)
       (pred_7 obj_06 obj_27)
       (pred_7 obj_06 obj_11)
       (pred_7 obj_07 obj_05)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_14)
       (pred_7 obj_07 obj_06)
       (pred_7 obj_01 obj_12)
       (pred_7 obj_01 obj_22)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_21 obj_20)
       (pred_7 obj_21 obj_09)
       (pred_7 obj_21 obj_19)
       (pred_7 obj_09 obj_03)
       (pred_7 obj_09 obj_25)
       (pred_7 obj_09 obj_11)
       (pred_7 obj_09 obj_21)
       (pred_7 obj_25 obj_29)
       (pred_7 obj_25 obj_05)
       (pred_7 obj_25 obj_06)
       (pred_7 obj_25 obj_09)
       (pred_7 obj_05 obj_23)
       (pred_7 obj_05 obj_12)
       (pred_7 obj_05 obj_07)
       (pred_7 obj_05 obj_25)
       (pred_7 obj_12 obj_24)
       (pred_7 obj_12 obj_01)
       (pred_7 obj_12 obj_05)
       (pred_7 obj_20 obj_10)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_20 obj_21)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_03 obj_29)
       (pred_7 obj_03 obj_09)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_29 obj_28)
       (pred_7 obj_29 obj_23)
       (pred_7 obj_29 obj_25)
       (pred_7 obj_29 obj_03)
       (pred_7 obj_23 obj_17)
       (pred_7 obj_23 obj_24)
       (pred_7 obj_23 obj_05)
       (pred_7 obj_23 obj_29)
       (pred_7 obj_24 obj_16)
       (pred_7 obj_24 obj_12)
       (pred_7 obj_24 obj_23)
       (pred_7 obj_10 obj_04)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_04 obj_28)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_10)
       (pred_7 obj_28 obj_17)
       (pred_7 obj_28 obj_29)
       (pred_7 obj_28 obj_04)
       (pred_7 obj_17 obj_16)
       (pred_7 obj_17 obj_23)
       (pred_7 obj_17 obj_28)
       (pred_7 obj_16 obj_24)
       (pred_7 obj_16 obj_17)
       (pred_3 obj_20)
       (pred_3 obj_27)
       (pred_3 obj_02)
       (pred_2  obj_20 obj_08)
       (pred_2  obj_27 obj_15)
       (pred_2  obj_02 obj_15)
       (pred_6 obj_13)
       (pred_6 obj_14)
       (pred_6 obj_22)
       (pred_6 obj_19)
       (pred_6 obj_11)
       (pred_6 obj_06)
       (pred_6 obj_07)
       (pred_6 obj_01)
       (pred_6 obj_21)
       (pred_6 obj_09)
       (pred_6 obj_25)
       (pred_6 obj_05)
       (pred_6 obj_12)
       (pred_6 obj_03)
       (pred_6 obj_29)
       (pred_6 obj_23)
       (pred_6 obj_24)
       (pred_6 obj_10)
       (pred_6 obj_04)
       (pred_6 obj_28)
       (pred_6 obj_17)
       (pred_6 obj_16)

       (pred_12  obj_26 obj_08)
       (pred_12  obj_18 obj_15)
       (pred_12  obj_30 obj_08)
       (pred_1 obj_26 obj_14)
       (pred_1 obj_18 obj_19)
       (pred_1 obj_30 obj_01)
       (pred_9 obj_17)
    )

    (:goal (and
       (pred_1 obj_30 obj_11)
    ))
(:constraints
  (always (not (pred_9 obj_07)))
)
)

; plan
1. (op_4 obj_17 obj_23)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_23)
   goals met: 0 of 1
2. (op_4 obj_23 obj_05)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_05)
   goals met: 0 of 1
3. (op_4 obj_05 obj_12)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_12)
   goals met: 0 of 1
4. (op_4 obj_12 obj_01)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_01)
   goals met: 0 of 1
5. (op_5 obj_01 obj_30)
   deleted: (pred_1 obj_30 obj_01) (pred_10)
   added: (pred_8 obj_30)
   goals met: 0 of 1
6. (op_4 obj_01 obj_12)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_12)
   goals met: 0 of 1
7. (op_4 obj_12 obj_05)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_05)
   goals met: 0 of 1
8. (op_4 obj_05 obj_25)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_25)
   goals met: 0 of 1
9. (op_4 obj_25 obj_06)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_06)
   goals met: 0 of 1
10. (op_4 obj_06 obj_11)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_11)
   goals met: 0 of 1
11. (op_3 obj_11 obj_30)
   deleted: (pred_8 obj_30)
   added: (pred_10) (pred_1 obj_30 obj_11)
   goals met: 1 of 1
